{"config": [{"config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa@/home/alex/Dokumente/SDC/SDCND/L14_behavioral_cloning/network.py\u00da\b<lambda>\u00e7\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "batch_input_shape": [null, 135, 320, 3], "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "arguments": {}, "trainable": true}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "bias": true, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "W_constraint": null, "nb_row": 5, "W_regularizer": null, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_2", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "bias": true, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "W_constraint": null, "nb_row": 5, "W_regularizer": null, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "bias": true, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "W_constraint": null, "nb_row": 5, "W_regularizer": null, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_4", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "nb_col": 3, "W_constraint": null, "nb_row": 3, "W_regularizer": null, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_5", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "nb_col": 3, "W_constraint": null, "nb_row": 3, "W_regularizer": null, "dim_ordering": "tf", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "output_dim": 200, "bias": true, "init": "glorot_uniform", "activation": "linear", "input_dim": 2880, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "b_regularizer": null, "activity_regularizer": null, "output_dim": 50, "bias": true, "init": "glorot_uniform", "activation": "linear", "input_dim": 200, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_7", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "bias": true, "init": "glorot_uniform", "activation": "linear", "input_dim": 50, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_8", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "bias": true, "init": "glorot_uniform", "activation": "linear", "input_dim": 10, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.0"}